# 哲学问题库： [cite: 36, 41, 49, 54]
QUESTION_BANK = {
    "自我与他人": [
        "如果有一天有一个和你看起来一模一样的分身，他需要学会哪些你拥有的东西才能完全和你一样呢？如果问你是谁你会怎么回答？",
        "如果没有人能看见你，你还存在吗？",
        "为什么要尊重他人？如果别人给你起了一个外号，你非常不喜欢，这个外号还能算作“你”的一部分吗？为什么？"
    ],
    "真善美": [
        "你怎么知道你现在不是在做梦？梦里出现的你认为真的东西在现实中都能找到对应吗？梦是真的吗？你觉得梦是什么呢？",
        "森林里有一棵树倒下了，但是没有人听到，那它有没有发出声音？",
        "什么是善？如果做了一件好事但是没有人知道也没有得到夸奖，还算善吗？",
        "什么是美？除了长的好看，还有什么可以被成为美?为什么大家认为美的东西或者事物都不一样？如果一件东西很旧、很破，但是它陪了你很久，你觉得它美吗？",
        "如果你发现了一个秘密，说出来会有人不开心，不说出来又憋得慌，你会怎么办？",
        "你有没有说过善意的谎言？比如？那还算是说谎吗？",
        "你觉得一朵花美，是因为它好看，还是因为它让你开心？"
    ],
    "自由与规则": [
        "你认为规则是谁制定的？如果一条规则不公平，那我们还要遵守吗？",
        "如果你排队时有人插队，你会怎么办？如果他是因为着急，你会改变你的做法吗？",
        "游乐园规定“1.2米以下不能玩过山车”，可你最好的朋友就差一点点就够高了，他特别想玩，你觉得应该让他偷偷上去吗？",
        "什么是自由？想做什么就做什么是自由吗？如果有一天世界上所有的规则都消失了，你最想做的一件事是什么？然后会发什么呢？"
    ],
    "生命与自然": [
        "机器人算生命吗？为什么呀？如果一只机器猫永远不会死，它会像普通的猫一样有感情吗？",
        "一棵大树活了很久，它比爷爷还老，它有生命，那它有思想吗？",
        "如果你养的小金鱼死了，你把它埋在花盆里，后来开花了，小金鱼还活着吗？",
        "你养过小宠物吗？那你认为动物有思想吗？它们会像我们一样思考吗？它不会说话，你觉得它能感受到你爱它吗？",
        "你见过蒲公英种子飞走吗？它有生命吗？它有思想吗？",
        "你觉得云有感觉吗？被风吹散的时候会不会“疼”呢？",
        "如果你是生长在路边的一棵树，看着每天人来人往，你会想什么呢？"
    ]
}